# Напишите ваше решение
a = int(input("Введите число а "))
b = int(input("Введите степень "))
c = a ** b
print(c)